---
kind: method
id: M:Autodesk.Revit.DB.OffsetSurface.IsOrientationSameAsBasisSurface
source: html/de30829a-52b3-7afc-ff09-0d891621d289.htm
---
# Autodesk.Revit.DB.OffsetSurface.IsOrientationSameAsBasisSurface Method

Indicates whether the orientation of the OffsetSurface is same as that of its basis surface,
 in the sense that their oriented normals at any (u, v) have the same direction.

## Syntax (C#)
```csharp
public bool IsOrientationSameAsBasisSurface()
```

## Returns
True if the orientation of the OffsetSurface is same as that of its basis surface, false otherwise.